PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog_dac.h
/***************************************************************************//**
* \file cy_autanalog_dac.h
* \version 2.0
*
* Provides an API declaration of the CT DAC subsystem of the Autonomous Analog.
*
********************************************************************************
* \copyright
* Copyright 2022-2025 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

/**
* \addtogroup group_autanalog_dac
* \{
* This driver provides API functions to configure the CT DAC subsystem of the Autonomous Analog.
*
* The CT DAC (hereafter DAC) is a 12-bit, continuous-time segmented DAC. It is based on an 8-bit R-2R array
* and a 4-bit thermometer array. A buffered sample and hold (S/H) circuit is useful for low power operation
* where an occasional update of the DAC output is acceptable. The DAC can be used in applications
* that require voltage references, bias, or analog waveform output. The DAC can work in conjunction with
* the CTB and PRB, which are used as buffered reference voltage sources.
*
* For more information on the CT DAC,
* refer to the device Architecture Technical Reference Manual (TRM).\n
* For the exact location of the pins, see the device datasheet.
*
* \section group_autanalog_dac_static Static Configuration
*
* The static configuration contains application-specific settings
* intended to remain static for any DAC application.
* The Autonomous Controller (AC) will NOT change the static configuration during operation.
*
* \image html LPPASS_DAC_Static.png
*
* The static configuration of the DAC includes:
* - Clock rate (for Low Power mode only);
* - Input data format (signed/unsigned);
* - Reference voltage source selector;
* - DAC topology and use of reference and output voltage buffers;
* - Output control settings;\n
* For configuration settings, refer to \ref cy_stc_autanalog_dac_sta_t.
*
* \section group_autanalog_dac_channels DAC Channels and State Transition Table
*
* Up to 15 configurations are available for the "virtual" DAC channels.
* The last channel with index 15 is preserved for updates from FW only.

* The DAC channel configuration includes:
* - Operating mode of the DAC (refer to \ref group_autanalog_dac_mode chapter);
* - The option to enable the S/H functionality (refer to \ref group_autanalog_dac_sampleAndHold chapter)
* - Start/end address and step size for the waveform in the LUT;
* - Output voltage range;\n
* For the configuration settings, refer to cy_stc_autanalog_dac_ch_t structure.
*
* The DAC channel can be switched by the Autonomous Controller (AC) in runtime
* per settings provided in the State Transition Table (refer to \ref cy_stc_autanalog_stt_dac_t structure)
*
* \section group_autanalog_dac_topology Topology
*
* \subsection group_autanalog_dac_vref Reference Voltage
*
* The reference voltage can be Vdda or an internal Vref used with or without the unity gain buffer
* for the reference voltage in the DAC:
* - VBGR - Internal, temperature-independent, band-gap voltage reference;
* - CTB_OA - The reference voltage is driven by the Opamp output in the CTB
*   (refer to \ref group_autanalog_ctb section);
* - PRB_VREF - The reference voltage is driven from the PRB
*   (refer to \ref cy_stc_autanalog_prb_t structure);
*
* \note Vdda is 1.8V and Vbgr is 0.9V
*
* \subsection group_autanalog_dac_path Output Paths
*
* The DAC output can be routed in different paths:
* - Direct output path (NOT to pin);
* - Direct output path with Ctrack capacitor connected;
* - Direct output path with Ctrack and Chold capacitors connected;
* - Buffered output path for internal connection within the chip;
* - Buffered output path for internal and external connections;
*
* \section group_autanalog_dac_pump Buffer Input and Output Ranges
*
* The input range of the buffer can be rail-to-rail if the charge pump is enabled.
* Without the charge pump, the input range is 0 V to VDDA - 1.5 V. The output range
* of the buffer is typically 0.2 V to VDDA - 1.0 V and will depend on the load.
* See the device datasheet for more details.
*
* <table class="doxtable">
*    <tr>
*       <th>Charge Pump</th>
*       <th>Input Range</th>
*       <th>Output Range</th>
*    </tr>
*    <tr>
*       <td>Enabled</td>
*       <td>0 V to VDDA</td>
*       <td>0.2 V to VDDA - 0.2 V</td>
*    </tr>
*    <tr>
*       <td>Disabled</td>
*       <td>0 V to VDDA - 1.5 V</td>
*       <td>0.2 V to VDDA - 1.0 V</td>
*    </tr>
* </table>
*
* \note The charge pump nominal clock is 4MHz
*
* For the configuration settings, see \ref cy_en_autanalog_dac_out_buf_pwr_t.
*
* \section group_autanalog_dac_rate Update Rates
*
* The DAC supports two update rates of operation:
* - Single step mode (default);
* - Continuous mode;\n
* In Single step mode, the DAC output changes on each subsequent trigger
* cy_stc_autanalog_stt_dac_t::trigger in the State Transition Table.\n
* In Continuous mode, the output value changes on each subsequent clock of the DAC.\n
* For more details, refer to \ref group_autanalog_dac_mode.
*
* \subsection group_autanalog_dac_clock Clocking
*
* The DAC is clocked from the SRSS peripheral clock
* (Clk_HF9, up to 80MHz, refer to \ref group_autanalog_section_configuration) in chip Active mode
* using Peri 0 Clock Group 2 8-bit divider in the clock chain.\n
* Or from the local Low Power Oscillator
* (LPOSC, 4096kHz, refer to \ref cy_en_autanalog_timer_clk_src_t) in chip Deep Sleep mode.\n
* The clock value can also be adjusted using the cy_stc_autanalog_dac_sta_t::lpDivDac,
* which divides the incoming clock in chip Deep Sleep mode.\n
*
* \section group_autanalog_dac_sampleAndHold Sample and Hold
*
* The cy_stc_autanalog_dac_ch_t::sampleAndHold mode allows duty cycling of the DAC
* where Chold capacitor (Chold >> Ctrack) holds the previous value of the DAC output.
* The cy_stc_autanalog_dac_sta_t::sampleTime is defined as the time it takes for
* the DAC output to drop by 1 LSB.
*
* The DAC is updated every positive edge of the DAC clock with the following sequence:
* - The DAC is configured for SAMPLE: the COS and CHD switches are closed, DAC array is enabled
* and outputs the updated value (based on \ref group_autanalog_dac_mode) onto a Chold capacitor
* for sample time duration;
* - The DAC is configured for HOLD: the COS switch is opened, CHD switch is closed, DAC array is disabled
* and the last output value is held on the Chold capacitor until the next positive edge of the DAC clock.
* HOLD duration is DAC clock period - duration of the sample time.
* \note For \ref group_autanalog_dac_mode ADDRESS or DATA, the AC must wait (ACTION = WAIT_FOR) for
* the DAC strobe (CONDITION = DAC_STROBE) before re-triggering the DAC_INC/DAC_DEC fields.
* Refer to \ref cy_en_autanalog_stt_ac_action_t and \ref cy_en_autanalog_stt_ac_condition_t.
*
* \section group_autanalog_dac_deglitch De-glitch
*
* A typical issue in DACs is the glitch during code transitions. Blanking can be used to reduce
* the glitch. During data changes, a dedicated switch on the output path is used to block the glitch
* from propagating to the DAC output. The Ctrack capacitor maintains the previous value
* while the switch is open, so the DAC output doesn't drop.
*
* If cy_stc_autanalog_dac_sta_t::topology is set to
* - CY_AUTANALOG_DAC_TOPO_DIRECT;
* - CY_AUTANALOG_DAC_TOPO_DIRECT_WITH_TRACK_CAP;
* - CY_AUTANALOG_DAC_TOPO_DIRECT_WITH_TRACK_HOLD_CAP;
*
* the CHD switch is opened during the de-glitch time.
*
* If cy_stc_autanalog_dac_sta_t::topology is set to
* - CY_AUTANALOG_DAC_TOPO_BUFFERED_INTERNAL;
* - CY_AUTANALOG_DAC_TOPO_BUFFERED_EXTERNAL;
*
* the COS switch is opened during the de-glitch time.
*
* De-glitch time set with cy_stc_autanalog_dac_sta_t::deGlitchTime and calculated as follow:\n
* (DEGLITCH_CNT + 1) / DAC_CLOCK_FREQ
*
* \section group_autanalog_dac_mode Operating Mode
*
* <table class="doxtable">
*    <tr>
*       <th>Mode</th>
*       <th>Description</th>
*    </tr>
*    <tr>
*       <td>One Shot, One Quadrant</td>
*       <td>
*           The LUT address is incremented on every positive edge of the DAC clock
*           until the END_ADDR is reached or exceeded.\n
*           The update step size is defined by STEP_VAL.\n
*           The One Shot mode is completed when the END_ADDR is reached.\n
*           The DAC outputs an EPOCH trigger after reaching (or exceeding)
*           the END_ADDR and outputting the corresponding value.
*       </td>
*    </tr>
*    <tr>
*       <td>One Shot, Two Quadrant</td>
*       <td>
*           The LUT address is incremented on every positive edge of the DAC clock
*           until the END_ADDR is reached*, then the LUT address is decremented back to the START_ADDR.\n
*           The DAC outputs an EPOCH trigger after returning to (or exceeding)
*           the START_ADDR and outputting the corresponding value.
*           \note *If the END_ADDR is not reached but exceeded
*           (which can happen with STEP_VAL greater than 1), the LUT address is decremented from
*           the END_ADDR by the amount exceeded).\n
*           After outputting the END_ADDR in one direction, while wrapping around in the reverse direction,
*           the STEP_VAL is decremented from this last address value (i.e. we output the last value only once
*           and while wrapping around in the reverse direction, we output the address that is the last address
*           minus the STEP_VAL).
*       </td>
*    </tr>
*    <tr>
*       <td>One Shot, Four Quadrant</td>
*       <td>
*           The LUT address is updated on every positive edge of the DAC clock
*           according to the following algorithm:\n
*              1. The LUT address is incremented until the END_ADDR is reached*\n
*              2. The LUT address is decremented until the START_ADDR is reached*\n
*              3. The polarity of the DAC output signal is inverted and steps 1 and 2 are repeated\n
*
*           The DAC outputs an EPOCH trigger after returning to (or exceeding)
*           the START_ADDR with an inverted polarity and outputting the corresponding value.\n
*           This mode assumes that the DAC waveform table constitutes 1/4 of the desired generated waveform.
*           \note *If the START_ADDR/END_ADDR address is not reached but instead exceeded
*           (which can happen with STEP_VAL greater than 1), the LUT address is adjusted
*           (i.e. decremented from END_ADDR or incremented from START_ADDR by the amount exceeded).\n
*           After outputting the START/END ADDR in one direction, while wrapping around in the opposite direction,
*           the STEP_VAL is incremented/decremented from this last address value (i.e. we output the last value only once
*           and when we go back in the opposite direction, we output the address that is the last address
*           plus/minus the STEP_VAL).
*       </td>
*    </tr>
*    <tr>
*       <td>Continuous, One Quadrant</td>
*       <td>
*           The LUT address is incremented on every positive edge of the DAC clock
*           until the END_ADDR is reached*.\n
*           The address then wraps back to the START_ADDR and repeats indefinitely.\n
*           The update step size is defined by STEP_VAL.\n
*           The DAC outputs an EPOCH trigger after reaching (or exceeding)
*           the END_ADDR and outputting the corresponding value.
*           \note *If the END_ADDR is not reached, but instead exceeded
*           (which can happen with STEP_VAL greater than 1), the LUT address wraps back
*           to START_ADDR and is incremented by the amount exceeded).
*       </td>
*    </tr>
*    <tr>
*       <td>Continuous, Two Quadrant</td>
*       <td>
*           The LUT address is incremented on every positive edge of the DAC clock
*           until the END_ADDR is reached*, then the LUT address is decremented back
*           to the START_ADDR and repeats indefinitely.\n
*           The DAC outputs an EPOCH trigger after returning to the START_ADDR
*           and outputting the corresponding value.
*           \note *If the START_ADDR or the END_ADDR is not reached but instead exceeded
*           (which can happen with STEP_VAL greater than 1), the LUT address is adjusted
*           (i.e. decremented from END_ADDR or incremented from START_ADDR by the amount exceeded).\n
*           After outputting the START/END ADDR in one direction, while wrapping around in the opposite direction,
*           the STEP_VAL is incremented/decremented from this last address value (i.e. we output the last value only once
*           and while wrapping around we output the address which is the last address plus/minus the STEP_VAL).
*       </td>
*    </tr>
*    <tr>
*       <td>Continuous, Four Quadrant</td>
*       <td>
*           The LUT address is updated on every positive edge of the DAC clock
*           according to the following algorithm:\n
*              1. The LUT address is incremented until the END_ADDR is reached*.
*              2. The LUT address is decremented until the START_ADDR is reached*.
*              3. The polarity of the DAC output signal is inverted and steps 1 and 2 are repeated indefinitely.\n
*
*           The DAC outputs an EPOCH trigger after returning to (or exceeding)
*           the START_ADDR with an inverted polarity and outputting the corresponding value.\n
*           This mode assumes that the DAC waveform table constitutes 1/4 of the desired generated waveform.
*           \note *If the START_ADDR/END_ADDR is not reached but instead exceeded
*           (which can happen with STEP_VAL greater than 1), the LUT address is adjusted
*           (i.e. decremented from END_ADDR or incremented from STAR_ADDR by the amount exceeded).\n
*           After outputting the START/END ADDR in one direction, while wrapping around in the opposite direction,
*           the STEP_VAL is incremented/decremented from this last address value (i.e. we output the last value only once
*           and while wrapping around in the opposite direction, we output the address that is the last address
*           plus/minus the STEP_VAL).
*       </td>
*    </tr>
*    <tr>
*       <td>Address mode</td>
*       <td>
*           The LUT address is updated on every positive edge of the DAC_INC or DAC_DEC
*           from the State Transition Table, see cy_stc_autanalog_stt_dac_t::direction,
*           unless cy_stc_autanalog_dac_ch_t::sampleAndhold is set\n
*           (for more details, refer to \ref group_autanalog_dac_sampleAndHold chapter).\n
*           The update step size is defined by STEP_VAL.\n
*           If on the START_ADDR and DAC_DEC is triggered, the address wraps forward to the END_ADDR.\n
*           If on the END_ADDR and DAC_INC is triggered, the address wraps back to the START_ADDR.\n
*           \note In this mode, the DAC does not output an EPOCH trigger.
*           \note The DAC does not support validation range conditions for address,
*                 see \ref cy_stc_autanalog_dac_ch_limit_t
*       </td>
*    </tr>
*    <tr>
*       <td>Data mode</td>
*       <td>
*           The DAC outputs the data stored at the START_ADDR.\n
*           The DAC output value is incremented or decremented based on
*           every positive edge of the DAC_INC or DAC_DEC from the State Transition Table,
*           see cy_stc_autanalog_stt_dac_t::direction, unless cy_stc_autanalog_dac_ch_t::sampleAndhold is set\n
*           (for more details, refer to \ref group_autanalog_dac_sampleAndHold chapter).\n
*           The increment/decrement amount is set by STEP_VAL.\n
*           \note In this mode, the DAC does not output an EPOCH trigger.
*           \note The DAC value is clamped if requested to go under the minimum code
*           (0x000 for unsigned or 0x800 for signed) or above the maximum code
*           (0xFFF for unsigned or 0x7FF for signed).
*       </td>
*    </tr>
* </table>
* Where START_ADDR, END_ADDR and STEP_VAL are configured individually for each channel:
* - The START_ADDR is defined in cy_stc_autanalog_dac_ch_t::startAddr;\n
* - The END_ADDR is defined in cy_stc_autanalog_dac_ch_t::endAddr;\n
* - The STEP_VAL is selected in cy_stc_autanalog_dac_ch_t::stepSel.\n
*
* For the configuration settings, see \ref cy_stc_autanalog_dac_ch_t::operMode.
*
* \section group_autanalog_dac_output Output Drive Control
*
* The DAC can be programmed so that code 0 corresponds to ground or 1 LSB.
* The bottom end of the R-2R ladder (LSB side) can be configured to connect to the Vref or Vssa
* using cy_stc_autanalog_dac_sta_t::bottomSel. This setting determines the output drive control
* in row with cy_stc_autanalog_stt_dac_t::enable, cy_stc_autanalog_dac_waveform_t::driveMode and
* cy_stc_autanalog_dac_sta_t::disabledMode as follow:
*
* <table class="doxtable">
*    <tr>
*       <th>DAC Enabled</th>
*       <th>Drive Mode</th>
*       <th>Disabled Mode</th>
*       <th>DAC Range</th>
*       <th>Output State</th>
*    </tr>
*    <tr>
*       <td>FALSE</td>
*       <td>X</td>
*       <td>X</td>
*       <td>X</td>
*       <td>tri-state</td>
*    </tr>
*    <tr>
*       <td>TRUE</td>
*       <td>Hi-Z</td>
*       <td>tri-state</td>
*       <td>X</td>
*       <td>tri-state</td>
*    </tr>
*    <tr>
*       <td>TRUE</td>
*       <td>Hi-Z</td>
*       <td>Vssa/Vref</td>
*       <td>Vssa</td>
*       <td>Vssa</td>
*    </tr>
*    <tr>
*       <td>TRUE</td>
*       <td>Hi-Z</td>
*       <td>Vssa/Vref</td>
*       <td>Vref</td>
*       <td>Vref</td>
*    </tr>
*    <tr>
*       <td>TRUE</td>
*       <td>Vref</td>
*       <td>tri-state</td>
*       <td>X</td>
*       <td>tri-state</td>
*    </tr>
*    <tr>
*       <td>TRUE</td>
*       <td>Vref</td>
*       <td>Vssa/Vref</td>
*       <td>Vssa</td>
*       <td>Vssa</td>
*    </tr>
*    <tr>
*       <td>TRUE</td>
*       <td>Vref</td>
*       <td>Vssa/Vref</td>
*       <td>Vref</td>
*       <td>Vref</td>
*    </tr>
*    <tr>
*       <td>TRUE</td>
*       <td>Enabled</td>
*       <td>X</td>
*       <td>Vssa</td>
*       <td>[0, 4095] * Vref / 4096</td>
*    </tr>
*    <tr>
*       <td>TRUE</td>
*       <td>Enabled</td>
*       <td>X</td>
*       <td>Vref</td>
*       <td>[1, 4096] * Vref / 4096</td>
*    </tr>
** </table>
*
* \section group_autanalog_dac_sign Signed/Unsigned Input
*
* The format of the DAC code can be either unsigned or signed two's complement.
* Only the first 12 bits are used by the DAC, so no sign extension is required.
* For the signed format, the DAC decodes the input code by adding 0x800.\n
*
* For the configuration settings, see \ref cy_stc_autanalog_dac_sta_t::sign.
*
* \section group_autanalog_dac_int Interrupts, Triggers and STT Events
*
* The following internal events of the DAC can be configured to generate an interrupt or trigger
* or used as the STT event in the Autonomous Analog
* (refer to \ref cy_en_autanalog_ac_out_trigger_mask_t and \ref cy_en_autanalog_stt_ac_condition_t):
* - DAC_EPOCH - Indicates end of waveform event;
* - DAC_RANGE - Indicates range detection conditions;
* - DAC_EMPTY (interrupt only) - Indicates empty conditions on FW channel (Ch#15),
*   refer to \ref Cy_AutAnalog_DAC_WriteNextSample ;
* - DAC_STROBE (STT event only) - Indicates the S/H iteration finished
*   (refer to \ref group_autanalog_dac_sampleAndHold chapter);
*
* \section group_autanalog_dac_sample1 Sample use case: FW Channel #15
*
* \snippet autanalog/snippet/autanalog_dac.c SNIPPET_DAC_CONFIG_COMMON
*
* \snippet autanalog/snippet/autanalog_dac.c SNIPPET_DAC_CONFIG_FWCH15
*
* \snippet autanalog/snippet/autanalog_dac.c SNIPPET_DAC_INIT_COMMON
*
* \snippet autanalog/snippet/autanalog_dac.c SNIPPET_DAC_INIT_FWCH15
*
* \section group_autanalog_dac_sample2 Sample use case: Output Analog Waveform
*
* \snippet autanalog/snippet/autanalog_dac.c SNIPPET_DAC_CONFIG_COMMON
*
* \snippet autanalog/snippet/autanalog_dac.c SNIPPET_DAC_DEFINE_WAVEFORM
*
* \snippet autanalog/snippet/autanalog_dac.c SNIPPET_DAC_CONFIG_WAVEFORM
*
* \snippet autanalog/snippet/autanalog_dac.c SNIPPET_DAC_INIT_COMMON
*
* \snippet autanalog/snippet/autanalog_dac.c SNIPPET_DAC_INIT_WAVEFORM
*
* \defgroup group_autanalog_dac_macros Macros
* \defgroup group_autanalog_dac_functions Functions
*   \{
*       \defgroup group_autanalog_dac_functions_init Initialization Functions
*       \defgroup group_autanalog_dac_functions_lut LUT Functions
*   \}
* \defgroup group_autanalog_dac_data_structures Data Structures
* \defgroup group_autanalog_dac_enums Enumerated Types
*/

#if !defined(CY_AUTANALOG_DAC_H)
#define CY_AUTANALOG_DAC_H

