PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog_dac.h
#include "cy_device.h"

#ifdef CY_IP_MXS22LPPASS_DAC

#include "cy_autanalog_common.h"

#if defined(__cplusplus)
extern "C" {
#endif

/** \addtogroup group_autanalog_dac_macros
* \{
*/

/** The maximum number of configurations for the DAC channels,
 * for more details, refer to the device Architecture Technical Reference Manual.
 */
#define CY_AUTANALOG_DAC_CH_CFG_NUM                    (15UL)

/** The maximum number of configuration structures to define the DAC channel range,
 * for more details, refer to the device Architecture Technical Reference Manual.
 */
#define CY_AUTANALOG_DAC_CH_RANGE_NUM                  (3UL)

/** The maximum number of configuration structures to define the DAC step value,
 * for more details, refer to the device Architecture Technical Reference Manual.
 */
#define CY_AUTANALOG_DAC_STEP_VAL_NUM                  (3UL)

/** The maximum number of samples in the DAC LUT
 * for more details, refer to the device Architecture Technical Reference Manual.
 */
#define CY_AUTANALOG_DAC_DATA_SAMPLES_NUM              (512U)

/** \cond INTERNAL */

/* Helper macros for range validation */
#define AUTANALOG_DAC_LUT_IDX(value)                   ((value) < CY_AUTANALOG_DAC_DATA_SAMPLES_NUM)

/* Validation macros for RANGE_STATUS register */
#define AUTANALOG_DAC_CH_RANGE_STATUS(value)           ((value) <= DAC_STA_RANGE_STATUS_CHAN_RANGE_STATUS_Msk)

/* Validation macro for AUTANALOG_DAC_LUT register */
#define AUTANALOG_DAC_OUT_DM(value)                    ((value) <= CY_AUTANALOG_DAC_OUT_DRIVE_MODE_VREF)

/** \endcond */

/** The DAC channels configurations */
#define CY_AUTANALOG_DAC_CHAN_CFG0                     (0x00000000UL) /**< The DAC channel 0 */
#define CY_AUTANALOG_DAC_CHAN_CFG1                     (0x00000001UL) /**< The DAC channel 1 */
#define CY_AUTANALOG_DAC_CHAN_CFG2                     (0x00000002UL) /**< The DAC channel 2 */
#define CY_AUTANALOG_DAC_CHAN_CFG3                     (0x00000003UL) /**< The DAC channel 3 */
#define CY_AUTANALOG_DAC_CHAN_CFG4                     (0x00000004UL) /**< The DAC channel 4 */
#define CY_AUTANALOG_DAC_CHAN_CFG5                     (0x00000005UL) /**< The DAC channel 5 */
#define CY_AUTANALOG_DAC_CHAN_CFG6                     (0x00000006UL) /**< The DAC channel 6 */
#define CY_AUTANALOG_DAC_CHAN_CFG7                     (0x00000007UL) /**< The DAC channel 7 */
#define CY_AUTANALOG_DAC_CHAN_CFG8                     (0x00000008UL) /**< The DAC channel 8 */
#define CY_AUTANALOG_DAC_CHAN_CFG9                     (0x00000009UL) /**< The DAC channel 9 */
#define CY_AUTANALOG_DAC_CHAN_CFG10                    (0x0000000AUL) /**< The DAC channel 10 */
#define CY_AUTANALOG_DAC_CHAN_CFG11                    (0x0000000BUL) /**< The DAC channel 11 */
#define CY_AUTANALOG_DAC_CHAN_CFG12                    (0x0000000CUL) /**< The DAC channel 12 */
#define CY_AUTANALOG_DAC_CHAN_CFG13                    (0x0000000DUL) /**< The DAC channel 13 */
#define CY_AUTANALOG_DAC_CHAN_CFG14                    (0x0000000EUL) /**< The DAC channel 14 */
#define CY_AUTANALOG_DAC_CHAN_CFG15                    (0x0000000FUL) /**< The DAC channel 15 */

/** The set of masks for defining the DAC channels */
#define CY_AUTANALOG_DAC_CHAN_MASK0                    (0x00000001UL) /**< The mask for channel 0 */
#define CY_AUTANALOG_DAC_CHAN_MASK1                    (0x00000002UL) /**< The mask for channel 1 */
#define CY_AUTANALOG_DAC_CHAN_MASK2                    (0x00000004UL) /**< The mask for channel 2 */
#define CY_AUTANALOG_DAC_CHAN_MASK3                    (0x00000008UL) /**< The mask for channel 3 */
#define CY_AUTANALOG_DAC_CHAN_MASK4                    (0x00000010UL) /**< The mask for channel 4 */
#define CY_AUTANALOG_DAC_CHAN_MASK5                    (0x00000020UL) /**< The mask for channel 5 */
#define CY_AUTANALOG_DAC_CHAN_MASK6                    (0x00000040UL) /**< The mask for channel 6 */
#define CY_AUTANALOG_DAC_CHAN_MASK7                    (0x00000080UL) /**< The mask for channel 7 */
#define CY_AUTANALOG_DAC_CHAN_MASK8                    (0x00000100UL) /**< The mask for channel 8 */
#define CY_AUTANALOG_DAC_CHAN_MASK9                    (0x00000200UL) /**< The mask for channel 9 */
#define CY_AUTANALOG_DAC_CHAN_MASK10                   (0x00000400UL) /**< The mask for channel 10 */
#define CY_AUTANALOG_DAC_CHAN_MASK11                   (0x00000800UL) /**< The mask for channel 11 */
#define CY_AUTANALOG_DAC_CHAN_MASK12                   (0x00001000UL) /**< The mask for channel 12 */
#define CY_AUTANALOG_DAC_CHAN_MASK13                   (0x00002000UL) /**< The mask for channel 13 */
#define CY_AUTANALOG_DAC_CHAN_MASK14                   (0x00004000UL) /**< The mask for channel 14 */

/** \} group_autanalog_dac_macros */

/***************************************
*       Enumerated Types
***************************************/

/**
* \addtogroup group_autanalog_dac_enums
* \{
*/

/**
 * Defines the connection topology for the DAC,
 * for more details, refer to the device Architecture Technical Reference Manual.
 */
typedef enum
{
    CY_AUTANALOG_DAC_TOPO_DIRECT                     = 0UL, /**< The DAC drives the output directly */
    CY_AUTANALOG_DAC_TOPO_DIRECT_WITH_TRACK_CAP      = 1UL, /**< The DAC drives the output directly
                                                             *   with a Ctrack capacitor at the output */
    CY_AUTANALOG_DAC_TOPO_DIRECT_WITH_TRACK_HOLD_CAP = 2UL, /**< The DAC drives output directly
                                                             *   with Ctrack and Chold capacitors
                                                             *   at the output */
    CY_AUTANALOG_DAC_TOPO_BUFFERED_INTERNAL          = 3UL, /**< The output of the DAC is buffered
                                                             *   (for internal connections only) */
    CY_AUTANALOG_DAC_TOPO_BUFFERED_EXTERNAL          = 4UL, /**< The output of the DAC is buffered
                                                             *   for internal or external connections */
} cy_en_autanalog_dac_topo_cfg_t;


/**
 * Defines the source of the reference voltage for the DAC,
 * for more details, refer to the device Architecture Technical Reference Manual.
 */
typedef enum
{
    CY_AUTANALOG_DAC_VREF_MUX_OUT = 0UL, /**< The DAC reference is driven by the reference multiplexer,
                                          *   see \ref cy_en_autanalog_dac_vref_mux_t. This option requires
                                          *   that \ref cy_stc_autanalog_dac_sta_t::refBuffPwr be set to a value
                                          *   other than OFF */
    CY_AUTANALOG_DAC_VREF_VDDA    = 1UL, /**< The DAC reference is driven directly from the Vdda.
                                          *   As this path does not use the DAC reference buffer,
                                          *   \ref cy_stc_autanalog_dac_sta_t::refBuffPwr should be set to OFF */
} cy_en_autanalog_dac_vref_sel_t;


/**
 * Defines Power mode for the reference buffer.
 * Each power setting consumes different levels of the current
 * and supports a different input range and gain bandwidth.
 * The charge pump is used to increase the input range to the rails.\n
 * For more details, refer to the device Architecture Technical Reference Manual.
 */
typedef enum
{
    CY_AUTANALOG_DAC_REF_BUF_PWR_OFF             =  0UL, /**< The power mode for the buffer is OFF,\n
                                                          *   the buffer is disabled */
    CY_AUTANALOG_DAC_REF_BUF_PWR_ULTRA_LOW       =  1UL, /**< The power mode for the buffer is ULTRA LOW,\n
                                                          *   the charge pump is OFF,\n
                                                          *   the buffer quiescent current is 15uA,\n
                                                          *   the gain bandwidth is 30kHz; */
    CY_AUTANALOG_DAC_REF_BUF_PWR_ULTRA_LOW_RAIL  =  2UL, /**< The power mode for the buffer is ULTRA LOW,\n
                                                          *   the charge pump is ON,\n
                                                          *   the buffer quiescent current is 35uA,\n
                                                          *   the gain bandwidth is 30kHz; */
    CY_AUTANALOG_DAC_REF_BUF_PWR_LOW_RAIL        =  4UL, /**< The power mode for the buffer is LOW,\n
                                                          *   the charge pump is ON,\n
                                                          *   the buffer quiescent current is 150uA,\n
                                                          *   the gain bandwidth is 350kHz; */
    CY_AUTANALOG_DAC_REF_BUF_PWR_MEDIUM_RAIL     =  6UL, /**< The power mode for the buffer is MEDIUM,\n
                                                          *   the charge pump is ON,\n
                                                          *   the buffer quiescent current is 200uA,\n
                                                          *   the gain bandwidth is 700kHz; */
    CY_AUTANALOG_DAC_REF_BUF_PWR_HIGH            =  7UL, /**< The power mode for the buffer is HIGH,\n
                                                          *   the charge pump is OFF,\n
                                                          *   the buffer quiescent current is 400uA,\n
                                                          *   the gain bandwidth is 1.75MHz;
                                                          *   \note This is the recommended power mode for
                                                          *   the DAC reference buffer when the DAC reference
                                                          *   is 0.9V or less. */
    CY_AUTANALOG_DAC_REF_BUF_PWR_HIGH_RAIL       =  8UL, /**< The power mode for the buffer is HIGH,\n
                                                          *   the charge pump is ON,\n
                                                          *   the buffer quiescent current is 600uA,\n
                                                          *   the gain bandwidth is 1.75MHz; */
    CY_AUTANALOG_DAC_REF_BUF_PWR_ULTRA_HIGH_RAIL = 10UL, /**< The power mode for the buffer is ULTRA HIGH,\n
                                                          *   the charge pump is ON,\n
                                                          *   the buffer quiescent current is 800uA,\n
                                                          *   the gain bandwidth is 2.8MHz; */
} cy_en_autanalog_dac_ref_buf_pwr_t;


/**
 * Defines Power mode for the output buffer.
 * Each power setting consumes different levels of the current
 * and supports a different input range and gain bandwidth.
 * The charge pump is used to increase the input range to the rails.\n
 * For more details, refer to the device Architecture Technical Reference Manual.
 */
typedef enum
{
    CY_AUTANALOG_DAC_OUT_BUF_PWR_OFF             =  0UL, /**< The power mode for the buffer is OFF,\n
                                                          *   the buffer is disabled */
    CY_AUTANALOG_DAC_OUT_BUF_PWR_ULTRA_LOW       =  1UL, /**< The power mode for the buffer is ULTRA LOW,\n
                                                          *   the charge pump is OFF,\n
                                                          *   the buffer quiescent current is 15uA,\n
                                                          *   the output drive capability is 10uA.
                                                          *   If cy_stc_autanalog_dac_sta_t::outBuffPwr is INTERNAL\n
                                                          *      the gain bandwidth is 30kHz;\n
                                                          *   If cy_stc_autanalog_dac_sta_t::outBuffPwr is EXTERNAL\n
                                                          *      the gain bandwidth is 100kHz; */
    CY_AUTANALOG_DAC_OUT_BUF_PWR_ULTRA_LOW_RAIL  =  2UL, /**< The power mode for the buffer is ULTRA LOW,\n
                                                          *   the charge pump is ON,\n
                                                          *   the buffer quiescent current is 35uA,\n
                                                          *   the output drive capability is 10uA.
                                                          *   If cy_stc_autanalog_dac_sta_t::outBuffPwr is INTERNAL\n
                                                          *      the gain bandwidth is 30kHz;\n
                                                          *   If cy_stc_autanalog_dac_sta_t::outBuffPwr is EXTERNAL\n
                                                          *      the gain bandwidth is 100kHz; */
    CY_AUTANALOG_DAC_OUT_BUF_PWR_LOW_RAIL        =  4UL, /**< The power mode for the buffer is LOW,\n
                                                          *   the charge pump is ON,\n
                                                          *   the buffer quiescent current is 150uA,\n
                                                          *   the output drive capability is 100uA.
                                                          *   If cy_stc_autanalog_dac_sta_t::outBuffPwr is INTERNAL\n
                                                          *      the gain bandwidth is 350kHz;\n
                                                          *   If cy_stc_autanalog_dac_sta_t::outBuffPwr is EXTERNAL\n
                                                          *      the gain bandwidth is 1.2MHz; */
    CY_AUTANALOG_DAC_OUT_BUF_PWR_MEDIUM_RAIL     =  6UL, /**< The power mode for the buffer is MEDIUM,\n
                                                          *   the charge pump is ON,\n
                                                          *   the buffer quiescent current is 200uA,\n
                                                          *   the output drive capability is 1mA.
                                                          *   If cy_stc_autanalog_dac_sta_t::outBuffPwr is INTERNAL\n
                                                          *      the gain bandwidth is 700kHz;\n
                                                          *   If cy_stc_autanalog_dac_sta_t::outBuffPwr is EXTERNAL\n
                                                          *      the gain bandwidth is 2.4MHz; */
    CY_AUTANALOG_DAC_OUT_BUF_PWR_HIGH_RAIL       =  8UL, /**< The power mode for the buffer is HIGH,\n
                                                          *   the charge pump is ON,\n
                                                          *   the buffer quiescent current is 600uA,\n
                                                          *   the output drive capability is 1mA.
                                                          *   If cy_stc_autanalog_dac_sta_t::outBuffPwr is INTERNAL\n
                                                          *      the gain bandwidth is 1.75MHz;\n
                                                          *   If cy_stc_autanalog_dac_sta_t::outBuffPwr is EXTERNAL\n
                                                          *      the gain bandwidth is 6MHz; */
    CY_AUTANALOG_DAC_OUT_BUF_PWR_ULTRA_HIGH_RAIL = 10UL, /**< The power mode for the buffer is ULTRA HIGH,\n
                                                          *   the charge pump is ON,\n
                                                          *   the buffer quiescent current is 800uA,\n
                                                          *   the output drive capability is 10mA.
                                                          *   If cy_stc_autanalog_dac_sta_t::outBuffPwr is INTERNAL\n
                                                          *      the gain bandwidth is 2.8MHz;\n
                                                          *   If cy_stc_autanalog_dac_sta_t::outBuffPwr is EXTERNAL\n
                                                          *      the gain bandwidth is 7.5MHz; */
} cy_en_autanalog_dac_out_buf_pwr_t;


/**
 * Defines the multiplexed reference voltage to be used for the DAC,
 * for more details, refer to the device Architecture Technical Reference Manual.
 */
typedef enum
{
    CY_AUTANALOG_DAC_VREF_MUX_VBGR      = 0UL, /**< The DAC reference is VBGR */
    CY_AUTANALOG_DAC_VREF_MUX_CTB0_OA0  = 1UL, /**< The DAC reference is driven by the Opamp0 output in the CTB0 */
    CY_AUTANALOG_DAC_VREF_MUX_CTB0_OA1  = 2UL, /**< The DAC reference is driven by the Opamp1 output in the CTB0 */
    CY_AUTANALOG_DAC_VREF_MUX_CTB1_OA0  = 3UL, /**< The DAC reference is driven by the Opamp0 output in the CTB1 */
    CY_AUTANALOG_DAC_VREF_MUX_CTB1_OA1  = 4UL, /**< The DAC reference is driven by the Opamp1 output in the CTB1 */
    CY_AUTANALOG_DAC_VREF_MUX_PRB_OUT0  = 6UL, /**< The DAC reference is Vref0 from the PRB0 */
    CY_AUTANALOG_DAC_VREF_MUX_PRB_OUT1  = 7UL, /**< The DAC reference is Vref1 from the PRB1 */

