PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog_dac.h
} cy_en_autanalog_dac_vref_mux_t;


/**
 * Defines the operating mode of the DAC, refer to \ref group_autanalog_dac_mode.
 * For more details, refer to the device Architecture Technical Reference Manual.
 */
typedef enum
{
    CY_AUTANALOG_DAC_LUT_OS_ONE_QUAD    = 0UL, /**< The LUT mode is One Shot One Quadrant */
    CY_AUTANALOG_DAC_LUT_OS_TWO_QUAD    = 1UL, /**< The LUT mode is One Shot Two Quadrant */
    CY_AUTANALOG_DAC_LUT_OS_FOUR_QUAD   = 2UL, /**< The LUT mode is One Shot Four Quadrant */
    CY_AUTANALOG_DAC_LUT_CONT_ONE_QUAD  = 3UL, /**< The LUT mode is Continuous One Quadrant */
    CY_AUTANALOG_DAC_LUT_CONT_TWO_QUAD  = 4UL, /**< The LUT mode is Continuous Two Quadrant */
    CY_AUTANALOG_DAC_LUT_CONT_FOUR_QUAD = 5UL, /**< The LUT mode is Continuous Four Quadrant */
    CY_AUTANALOG_DAC_WAVEFORM_MODE_ADDR = 6UL, /**< The LUT operates in Address mode */
    CY_AUTANALOG_DAC_WAVEFORM_MODE_DATA = 7UL, /**< The LUT operates in Data mode */

} cy_en_autanalog_dac_oper_mode_t;


/**
 * The step selector for the DAC,
 * defines the selected step movement in the LUT.
 * For more details, refer to the device Architecture Technical Reference Manual.
 */
typedef enum
{
    CY_AUTANALOG_DAC_STEP_SEL_DISABLED = 0UL, /**< The selector is not used,
                                               *   the step value is 1 by default */
    CY_AUTANALOG_DAC_STEP_SEL_0        = 1UL, /**< The step value stored in the array
                                               *   cy_stc_autanalog_dac_sta_t::stepVal
                                               *   at index zero is used */
    CY_AUTANALOG_DAC_STEP_SEL_1        = 2UL, /**< The step value stored in the array
                                               *   cy_stc_autanalog_dac_sta_t::stepVal
                                               *   at index one is used */
    CY_AUTANALOG_DAC_STEP_SEL_2        = 3UL, /**< The step value stored in the array
                                               *   cy_stc_autanalog_dac_sta_t::stepVal
                                               *   at index two is used */
} cy_en_autanalog_dac_step_sel_t;


/**
 * The DAC range status selector,
 * defines the selected range conditions for the DAC output value.
 * For more details, refer to the device Architecture Technical Reference Manual.
 */
typedef enum
{
    CY_AUTANALOG_DAC_STATUS_SEL_DISABLED = 0UL, /**< The selector is not used,
                                                 *   the DAC output is not validated for
                                                 *   compliance with the range conditions */
    CY_AUTANALOG_DAC_STATUS_SEL_0        = 1UL, /**< The DAC output range stored in the array
                                                 *   cy_stc_autanalog_dac_sta_t::chLimitCfg
                                                 *   at index zero is used for validation */
    CY_AUTANALOG_DAC_STATUS_SEL_1        = 2UL, /**< The DAC output range stored in the array
                                                 *   cy_stc_autanalog_dac_sta_t::chLimitCfg
                                                 *   at index one is used for validation */
    CY_AUTANALOG_DAC_STATUS_SEL_2        = 3UL, /**< The DAC output range stored in the array
                                                 *   cy_stc_autanalog_dac_sta_t::chLimitCfg
                                                 *   at index two is used for validation */
} cy_en_autanalog_dac_stat_sel_t;


/**
 * Defines the drive mode for the DAC output,
 * for more details, refer to the device Architecture Technical Reference Manual.
 */
typedef enum
{
    CY_AUTANALOG_DAC_OUT_DRIVE_MODE_EN   = 0UL, /**< The DAC output is enabled (outputs appropriate value) */
    CY_AUTANALOG_DAC_OUT_DRIVE_MODE_HIZ  = 1UL, /**< The DAC output is disabled (output is tri-state) */
    CY_AUTANALOG_DAC_OUT_DRIVE_MODE_VREF = 2UL, /**< The DAC output is disabled (output is Vssa or Vref,
                                                 *   depends on parameter
                                                 *   \ref cy_stc_autanalog_dac_sta_t::bottomSel) */
} cy_en_autanalog_dac_out_drive_mode_t;


/**
 * Defines the range detection conditions for the DAC output,
 * refer to cy_stc_autanalog_dac_ch_limit_t.
 * For more details, refer to the device Architecture Technical Reference Manual.
 */
typedef enum
{
    CY_AUTANALOG_DAC_CH_LIMIT_BELOW   = 0UL, /**< The DAC value must satisfy the following:\n
                                              *   Value < cy_stc_autanalog_dac_ch_limit_t::low */
    CY_AUTANALOG_DAC_CH_LIMIT_INSIDE  = 1UL, /**< The DAC value must satisfy the following:\n
                                              *   (cy_stc_autanalog_dac_ch_limit_t::low <= Value) AND
                                              *   (Value < cy_stc_autanalog_dac_ch_limit_t::high) */
    CY_AUTANALOG_DAC_CH_LIMIT_ABOVE   = 2UL, /**< The DAC value must satisfy the following:\n
                                              *   Value > cy_stc_autanalog_dac_ch_limit_t::high */
    CY_AUTANALOG_DAC_CH_LIMIT_OUTSIDE = 3UL, /**< The DAC value must satisfy the following:\n
                                              *   (Value < cy_stc_autanalog_dac_ch_limit_t::low) OR
                                              *   (Value >= cy_stc_autanalog_dac_ch_limit_t::high) */
} cy_en_autanalog_dac_limit_t;


/**
 * Defines the direction of movement in the LUT or the increment/decrement of the DAC value
 * using the State Transition table, refer to cy_stc_autanalog_stt_dac_t.
 * For more details, refer to the device Architecture Technical Reference Manual.
 */
typedef enum
{
    CY_AUTANALOG_DAC_DIRECTION_DISABLED = 0UL, /**< Direction is NOT selected */
    CY_AUTANALOG_DAC_DIRECTION_FORWARD  = 1UL, /**< Forward/Increment */
    CY_AUTANALOG_DAC_DIRECTION_REVERSE  = 2UL, /**< Backward/Decrement */

} cy_en_autanalog_stt_dac_dir_t;

/** \} group_autanalog_dac_enums */

/***************************************
*       Configuration Structures
***************************************/

/**
* \addtogroup group_autanalog_dac_data_structures
* \{
*/

/**
 * The configuration structure of the DAC channel.
 * Used in \ref cy_stc_autanalog_dac_sta_t
 */
typedef struct
{
    uint16_t                        startAddr;     /**< Start address of the waveform in the LUT.
                                                     *  When the DAC is triggered
                                                     *  (refer to \ref cy_stc_autanalog_stt_dac_t),
                                                     *  it outputs the value at START_ADDR.
                                                     *  The START_ADDR is word (16 bits) aligned and the value ranges
                                                     *  from 0 to 511 */
    uint16_t                        endAddr;       /**< End address of the waveform in the LUT.
                                                     *  The end address must be greater than or equal to
                                                     *  the start address (START_ADDR).
                                                     *  The END_ADDR is word (16 bit) aligned and the value ranges
                                                     *  from 0 to 511 */
    cy_en_autanalog_dac_oper_mode_t operMode;      /**< The DAC operating mode,
                                                     *  for more details, refer to \ref group_autanalog_dac_mode */
    bool                            sampleAndHold; /**< Enables Sample and Hold functionality for the DAC,
                                                     *  for more details, refer to \ref group_autanalog_dac_sampleAndHold */
    cy_en_autanalog_dac_step_sel_t  stepSel;       /**< The step selector for the DAC */
    cy_en_autanalog_dac_stat_sel_t  statSel;       /**< The status selector for the DAC output range */

