PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog_dac.h
} cy_stc_autanalog_dac_ch_t;


/**
 * The channel range detection configuration structure.
 * Used in \ref cy_stc_autanalog_dac_sta_t.
 */
typedef struct
{
    cy_en_autanalog_dac_limit_t cond; /**< Range detection condition */
    int16_t                     low;  /**< Low threshold for range detection */
    int16_t                     high; /**< High threshold for range detection */

} cy_stc_autanalog_dac_ch_limit_t;


/**
 * The configuration structure of the waveform.
 * Used in \ref cy_stc_autanalog_dac_t.
 */
typedef struct
{
    uint16_t                               numSamples;       /**< The number of samples in the waveform */
    const int16_t                         *waveformData;     /**< The pointer to the waveform data */
    bool                                   isDriveModeArray; /**< Indicates that all samples in the waveform array
                                                              *   have the same drive mode configuration */
    cy_en_autanalog_dac_out_drive_mode_t *driveMode;         /**< The pointer to the drive mode configurations */

}   cy_stc_autanalog_dac_waveform_t;


/**
* Defines the static configuration structure, see \ref group_autanalog_dac_static.
* Used in \ref cy_stc_autanalog_dac_t and \ref Cy_AutAnalog_DAC_LoadStaticConfig.
*/
typedef struct
{
    uint16_t                          lpDivDac;                                 /**< The Low Power clock divider,
                                                                                 *   actual divide value is DIV_VAL + 1,
                                                                                 *   valid range is 1..1024.
                                                                                 *   For more details, refer to
                                                                                 *   \ref group_autanalog_dac_clock
                                                                                 *   chapter
                                                                                 */
    cy_en_autanalog_dac_topo_cfg_t    topology;                                 /**< The DAC topology,
                                                                                 *   for more details, refer to
                                                                                 *   \ref group_autanalog_dac_topology
                                                                                 *   chapter */
    cy_en_autanalog_dac_vref_sel_t    vrefSel;                                  /**< The DAC source of the Vref,
                                                                                 *   for more details, refer to
                                                                                 *   \ref group_autanalog_dac_vref
                                                                                 *   chapter */
    bool                              deGlitch;                                 /**< Enables the DAC de-glitch functionality,
                                                                                 *   for more details, refer to
                                                                                 *   \ref group_autanalog_dac_deglitch
                                                                                 *   chapter
                                                                                 *   - FALSE - disabled;
                                                                                 *   - TRUE - enabled;
                                                                                */
    bool                              bottomSel;                                /**< The selector for the connecting the
                                                                                 *   bottom end of the R-2R resistors ladder,
                                                                                 *   for more details, refer to
                                                                                 *   \ref group_autanalog_dac_output
                                                                                 *   chapter
                                                                                 *   - FALSE - connect to Vssa;
                                                                                 *   - TRUE - connect to Vref;
                                                                                 */
    bool                              disabledMode;                             /**< The selector for the DAC output value
                                                                                 *   when the output is disabled,
                                                                                 *   for more details, refer to
                                                                                 *   \ref group_autanalog_dac_output
                                                                                 *   chapter
                                                                                 *   - FALSE - tri-state output;
                                                                                 *   - TRUE - output Vssa or Vref,
                                                                                 *     depends on the setting in the
                                                                                 *     cy_stc_autanalog_dac_sta_t::bottomSel
                                                                                 *     field;
                                                                                 */
    cy_en_autanalog_dac_ref_buf_pwr_t refBuffPwr;                               /**< The power mode of the
                                                                                 *   reference voltage buffer,
                                                                                 *   for more details, refer to
                                                                                 *   \ref group_autanalog_dac_topology
                                                                                 *   chapter */
    cy_en_autanalog_dac_out_buf_pwr_t outBuffPwr;                               /**< The power mode of the
                                                                                 *   output voltage buffer,
                                                                                 *   for more details, refer to
                                                                                 *   \ref group_autanalog_dac_topology
                                                                                 *   chapter */
    bool                              sign;                                     /**< Output data as a unsigned/signed value,
                                                                                 *   for more details, refer to
                                                                                 *   \ref group_autanalog_dac_sign
                                                                                 *   chapter
                                                                                 *   - FALSE - unsigned 12-bit number;
                                                                                 *   - TRUE - virtual signed 12-bits number;
                                                                                 */
    cy_en_autanalog_dac_vref_mux_t    vrefMux;                                  /**< Multiplexed reference voltage,
                                                                                 *   for more details, refer to
                                                                                 *   \ref group_autanalog_dac_vref */
    uint8_t                           sampleTime;                               /**< The sample time selection for the
                                                                                 *   cy_stc_autanalog_dac_ch_t::sampleAndHold.
                                                                                 *   Actual value is SAMPLE_TIME + 1,
                                                                                 *   range 1..256
                                                                                 *   \note The sample time is measured
                                                                                 *   in terms of the number of clock cycles.
                                                                                 */
    uint8_t                           stepVal[CY_AUTANALOG_DAC_STEP_VAL_NUM];   /**< The DAC step value.
                                                                                 *   Actual step value is STEP_VAL + 1.
                                                                                 *   for more details, refer to
                                                                                 *   \ref group_autanalog_dac_mode
                                                                                 *   chapter
                                                                                 */
    uint8_t                           deGlitchTime;                             /**< The DAC de-glitch time,
                                                                                 *   for more details, refer to
                                                                                 *   \ref group_autanalog_dac_deglitch
                                                                                 *   Actual value is DEGLITCH_CNT + 1,
                                                                                 *   range 1..256
                                                                                 *   \note The sample time is measured
                                                                                 *   in terms of the number of clock cycles.
                                                                                 */
    cy_stc_autanalog_dac_ch_t        *chCfg[CY_AUTANALOG_DAC_CH_CFG_NUM];       /**< The array of pointers to the
                                                                                 *   configuration structures for the
                                                                                 *   DAC channels, a NULL element
                                                                                 *   means that the channel structure
                                                                                 *   is not configured.
                                                                                 */
    cy_stc_autanalog_dac_ch_limit_t *chLimitCfg[CY_AUTANALOG_DAC_CH_RANGE_NUM];/**< The array of pointers to the
                                                                                 *   configuration structures for the
                                                                                 *   DAC output range detection,
                                                                                 *   a NULL element means that the
                                                                                 *   range detection is not configured.
                                                                                 */
} cy_stc_autanalog_dac_sta_t;


/**
* The configuration structure to set up the entire DAC.
* Used in \ref Cy_AutAnalog_DAC_LoadConfig.
*/
typedef struct
{
    /* Static part of configuration */
    cy_stc_autanalog_dac_sta_t       *dacStaCfg; /**< The pointer to a static part of the DAC configuration */

    /* Waveform part of configuration */
    cy_stc_autanalog_dac_waveform_t *waveform;   /**< The pointer to a waveform part of the DAC configuration */

} cy_stc_autanalog_dac_t;


/**
 * The DAC section in the State Transition Table state.
 * Used in \ref cy_stc_autanalog_stt_t.
 */
typedef struct
{
    bool                          unlock;    /**< DAC Unlock\n
                                              * - FALSE - Locked:\n
                                              *     Data from fields
                                              *     enable, trigger, channel and direction
                                              *     of this structure
                                              *     are NOT taken into account in
                                              *     the corresponding state of STT;
                                              * - TRUE - Unlocked:\n
                                              *     Data from fields
                                              *     enable, trigger, channel and direction
                                              *     of this structure
                                              *     are used in the STT corresponding state;
                                              */
    bool                          enable;    /**< Enables the DAC. */
    bool                          trigger;   /**< This field initiates the DAC operation
                                              *   per selected channel. */
    uint8_t                       channel;   /**< The DAC channel selector,
                                              *   refer to cy_stc_autanalog_dac_sta_t::chCfg
                                              */
    cy_en_autanalog_stt_dac_dir_t direction; /**< Defines the direction of movement in the LUT or
                                              *   the increment/decrement of the DAC value
                                              */
} cy_stc_autanalog_stt_dac_t;

/** \} group_autanalog_dac_data_structures */

