PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog_dac.h
/***************************************
*        Function Prototypes
***************************************/

/**
* \addtogroup group_autanalog_dac_functions
* \{
*/

/**
* \addtogroup group_autanalog_dac_functions_init
* This set of functions is used to configure the DAC.
* \{
*/

/*******************************************************************************
* Function Name: Cy_AutAnalog_DAC_LoadConfig
****************************************************************************//**
*
* Configures the DAC per provided static and waveform settings.
*
* \note Changing Vref from external to internal (or vice versa) or
* enabling/disabling buffers requires a new initialization delay for the DAC subsystem.
* Use a global API \ref Cy_AutAnalog_LoadConfig instead of the local API.
*
* \param dacIdx
* The index of the DAC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::dac
*
* \param dacCfg
* The pointer to a structure containing the static and waveform parts of the configuration data
* for the entire DAC.
*
* \return
* Status of initialization, \ref cy_en_autanalog_status_t.
*
*******************************************************************************/
cy_en_autanalog_status_t Cy_AutAnalog_DAC_LoadConfig(uint8_t dacIdx, const cy_stc_autanalog_dac_t * dacCfg);


/*******************************************************************************
* Function Name: Cy_AutAnalog_DAC_LoadStaticConfig
****************************************************************************//**
*
* Configures the DAC per settings in the static configuration structure.
*
* \note Changing Vref from external to internal (or vice versa) or
* enabling/disabling buffers requires a new initialization delay for the DAC subsystem.
* Use a global API \ref Cy_AutAnalog_LoadConfig instead of the local API.
*
* \param dacIdx
* The index of the DAC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::dac
*
* \param dacStaCfg
* The pointer to a structure containing static configuration data for the DAC.
*
* \return
* Status of initialization, \ref cy_en_autanalog_status_t.
*
*******************************************************************************/
cy_en_autanalog_status_t Cy_AutAnalog_DAC_LoadStaticConfig(uint8_t dacIdx, const cy_stc_autanalog_dac_sta_t * dacStaCfg);

/** \} group_autanalog_dac_functions_init */


/*******************************************************************************
* Function Name: Cy_AutAnalog_DAC_GetLimitStatus
****************************************************************************//**
*
* Provides the range detection status for the DAC channels, except FW channel #15.
* The DAC sets this bit for each channel when the condition specified by the
* \ref cy_stc_autanalog_dac_sta_t::chLimitCfg is met.
*
* \param dacIdx
* The index of the DAC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::dac
*
* \return
* Range detection status. Compare this value with one of the masks for the DAC channels.
* \note Under invalid DAC index, "zero" returns in the result.
*
*******************************************************************************/
__STATIC_INLINE uint16_t Cy_AutAnalog_DAC_GetLimitStatus(uint8_t dacIdx)
{
    uint32_t baseAddr;

    return CY_AUTANALOG_SUCCESS == Cy_AutAnalog_IdxToBaseAddr(CY_AUTANALOG_DAC, dacIdx, &baseAddr) ?
           (uint16_t)_FLD2VAL(DAC_STA_RANGE_STATUS_CHAN_RANGE_STATUS, AUTANALOG_DAC_RANGE_STATUS(baseAddr)) : 0U;
}


/*******************************************************************************
* Function Name: Cy_AutAnalog_DAC_ClearLimitStatus
****************************************************************************//**
*
* Clears the range detection status for the DAC channels.
* See \ref Cy_AutAnalog_DAC_GetLimitStatus
*
* \param dacIdx
* The index of the DAC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::dac
* \note Under invalid DAC index, the function has no effect.
*
* \param chMask
* The combined mask for DAC channels that require a reset of their range detection status.
*
*******************************************************************************/
__STATIC_INLINE void Cy_AutAnalog_DAC_ClearLimitStatus(uint8_t dacIdx, uint16_t chMask)
{
    uint32_t baseAddr;

    CY_ASSERT_L2(AUTANALOG_DAC_CH_RANGE_STATUS(chMask));

    if (CY_AUTANALOG_SUCCESS == Cy_AutAnalog_IdxToBaseAddr(CY_AUTANALOG_DAC, dacIdx, &baseAddr))
    {
        AUTANALOG_DAC_RANGE_STATUS(baseAddr) = _VAL2FLD(DAC_STA_RANGE_STATUS_CHAN_RANGE_STATUS, chMask);
    }
}


/*******************************************************************************
* Function Name: Cy_AutAnalog_DAC_WriteNextSample
****************************************************************************//**
*
* Loads a value that will update the DAC output on the next refresh cycle,
* applicable to FW channel #15 only.
*
* \param dacIdx
* The index of the DAC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::dac
* \note Under invalid DAC index, the function has no effect.
*
* \param sample
* The sample value to update of the DAC output for the next refresh cycle.
*
*******************************************************************************/
__STATIC_INLINE void Cy_AutAnalog_DAC_WriteNextSample(uint8_t dacIdx, int32_t sample)
{
    uint32_t baseAddr;

    if (CY_AUTANALOG_SUCCESS == Cy_AutAnalog_IdxToBaseAddr(CY_AUTANALOG_DAC, dacIdx, &baseAddr))
    {
        CY_REG32_CLR_SET(AUTANALOG_DAC_FW_DAC_VAL_NXT(baseAddr), DAC_STA_FW_DAC_VAL_NXT_VALUE, (uint32_t)sample);
    }
}


/*******************************************************************************
* Function Name: Cy_AutAnalog_DAC_ReadNextSample
****************************************************************************//**
*
* Reads the DAC output register.
* Applicable to FW channel #15 only.
*
* \param dacIdx
* The index of the DAC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::dac
*
* \return
* The sample value from the DAC output.
* \note If the DAC index is not valid, zero is returned in the result.
* \note The DAC HW does not preserve the sign of the output value.
*
*******************************************************************************/
__STATIC_INLINE int32_t Cy_AutAnalog_DAC_ReadNextSample(uint8_t dacIdx)
{
    uint32_t baseAddr;

    CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.8', 1, 'Review shows that type conversion from unsigned to signed does not have any negative drawbacks');
    return CY_AUTANALOG_SUCCESS == Cy_AutAnalog_IdxToBaseAddr(CY_AUTANALOG_DAC, dacIdx, &baseAddr) ?
           (int32_t)_FLD2VAL(DAC_STA_FW_DAC_VAL_NXT_VALUE, AUTANALOG_DAC_FW_DAC_VAL_NXT(baseAddr)) : 0;
    CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.8');
}


/**
* \addtogroup group_autanalog_dac_functions_lut
* This set of functions is used for data handling in the DAC look-up table.
* \{
*/

