PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog_dac.h
/*******************************************************************************
* Function Name: Cy_AutAnalog_DAC_Data_ReadSample
****************************************************************************//**
*
* Reads data for a DAC sample from the look-up table at the defined index.
* \note The DAC should not output a waveform while this API is being called.
*
* \param dacIdx
* The index of the DAC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::dac
*
* \param dataIdx
* The sample index in the DAC look-up table.
*
* \return
* The sample value from the DAC look-up table.
* \note Under invalid DAC index, "zero" returns in the result.
* \note The DAC HW does not preserve the sign of the output value.
*
*******************************************************************************/
__STATIC_INLINE int32_t Cy_AutAnalog_DAC_Data_ReadSample(uint8_t dacIdx, uint16_t dataIdx)
{
    uint32_t baseAddr;

    CY_ASSERT_L2(AUTANALOG_DAC_LUT_IDX(dataIdx));

    CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.8', 1, 'Review shows that type conversion from unsigned to signed does not have any negative drawbacks');
    return CY_AUTANALOG_SUCCESS == Cy_AutAnalog_IdxToBaseAddr(CY_AUTANALOG_DAC, dacIdx, &baseAddr) ?
           (int32_t)_FLD2VAL(DAC_SRAM_WAVEFORM, AUTANALOG_DAC_LUT(baseAddr, dataIdx)) : 0;
    CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.8');
}


/*******************************************************************************
* Function Name: Cy_AutAnalog_DAC_Data_GetDriveMode
****************************************************************************//**
*
* Reads the drive mode of the DAC output from the look-up table at the defined index.
* \note The DAC should not output a waveform while this API is being called.
*
* \param dacIdx
* The index of the DAC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::dac
*
* \param dataIdx
* The sample index in the DAC look-up table.
*
* \return
* The configuration of the DAC output drive mode, see \ref cy_en_autanalog_dac_out_drive_mode_t.
* \note Under invalid DAC index, CY_AUTANALOG_DAC_OUT_DRIVE_MODE_EN returns in the result.
*
*******************************************************************************/
__STATIC_INLINE cy_en_autanalog_dac_out_drive_mode_t Cy_AutAnalog_DAC_Data_GetDriveMode(uint8_t dacIdx, uint16_t dataIdx)
{
    cy_en_autanalog_dac_out_drive_mode_t result = CY_AUTANALOG_DAC_OUT_DRIVE_MODE_EN;

    uint32_t baseAddr;
    uint32_t regVal;

    CY_ASSERT_L2(AUTANALOG_DAC_LUT_IDX(dataIdx));

    if (CY_AUTANALOG_SUCCESS == Cy_AutAnalog_IdxToBaseAddr(CY_AUTANALOG_DAC, dacIdx, &baseAddr))
    {
        regVal = _FLD2VAL(DAC_SRAM_OUT_DM, AUTANALOG_DAC_LUT(baseAddr, dataIdx));

        if ((uint32_t)CY_AUTANALOG_DAC_OUT_DRIVE_MODE_EN == regVal)
        {
            result = CY_AUTANALOG_DAC_OUT_DRIVE_MODE_EN;
        }
        else if ((uint32_t)CY_AUTANALOG_DAC_OUT_DRIVE_MODE_HIZ == regVal)
        {
            result = CY_AUTANALOG_DAC_OUT_DRIVE_MODE_HIZ;
        }
        else if ((uint32_t)CY_AUTANALOG_DAC_OUT_DRIVE_MODE_VREF == regVal)
        {
            result = CY_AUTANALOG_DAC_OUT_DRIVE_MODE_VREF;
        }
        else
        {
            ;    /* Required by Rule 15.7 MISRA2012 */
        }
    }

    return result;
}


/*******************************************************************************
* Function Name: Cy_AutAnalog_DAC_Data_WriteSample
****************************************************************************//**
*
* Writes data for a DAC sample to a look-up table at a defined index.
* \note The DAC should not output a waveform while this API is being called.
*
* \param dacIdx
* The index of the DAC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::dac
*
* \param dataIdx
* The sample index in the DAC look-up table.
* \note Under invalid DAC index, the function has no effect.
*
* \param sample
* The sample value for the DAC look-up table.
*
*******************************************************************************/
__STATIC_INLINE void Cy_AutAnalog_DAC_Data_WriteSample(uint8_t dacIdx, uint16_t dataIdx, int32_t sample)
{
    uint32_t baseAddr;

    CY_ASSERT_L2(AUTANALOG_DAC_LUT_IDX(dataIdx));

    if (CY_AUTANALOG_SUCCESS == Cy_AutAnalog_IdxToBaseAddr(CY_AUTANALOG_DAC, dacIdx, &baseAddr))
    {
        CY_REG32_CLR_SET(AUTANALOG_DAC_LUT(baseAddr, dataIdx), DAC_SRAM_WAVEFORM, (uint32_t)sample);
    }
}


/*******************************************************************************
* Function Name: Cy_AutAnalog_DAC_Data_SetDriveMode
****************************************************************************//**
*
* Writes the drive mode of the DAC output to the look-up table at a defined index.
* \note The DAC should not output a waveform while this API is being called.
*
* \param dacIdx
* The index of the DAC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::dac
*
* \param dataIdx
* The sample index in the DAC look-up table.
* \note Under invalid DAC index, the function has no effect.
*
* \param driveMode
* The configuration of the DAC output drive mode, see \ref cy_en_autanalog_dac_out_drive_mode_t.
*
*******************************************************************************/
__STATIC_INLINE void Cy_AutAnalog_DAC_Data_SetDriveMode(uint8_t dacIdx, uint16_t dataIdx, cy_en_autanalog_dac_out_drive_mode_t driveMode)
{
    uint32_t baseAddr;

    CY_ASSERT_L2(AUTANALOG_DAC_LUT_IDX(dataIdx));
    CY_ASSERT_L2(AUTANALOG_DAC_OUT_DM(driveMode));

    if (CY_AUTANALOG_SUCCESS == Cy_AutAnalog_IdxToBaseAddr(CY_AUTANALOG_DAC, dacIdx, &baseAddr))
    {
        CY_REG32_CLR_SET(AUTANALOG_DAC_LUT(baseAddr, dataIdx), DAC_SRAM_OUT_DM, driveMode);
    }
}


/*******************************************************************************
* Function Name: Cy_AutAnalog_DAC_Data_ReadWaveform
****************************************************************************//**
*
* Reads a block of samples for the entire waveform from the DAC look-up table,
* starting from a defined index.
* \note The DAC should not output a waveform while this API is being called.
* \note The function does not apply if the channel operMode is set to
* CY_AUTANALOG_DAC_WAVEFORM_MODE_DATA, see \ref cy_stc_autanalog_dac_ch_t::operMode.
*
* \param dacIdx
* The index of the DAC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::dac
*
* \param dataIdx
* Start index of the DAC waveform in the look-up table.
* See \ref cy_stc_autanalog_dac_ch_t::startAddr
*
* \param numSamples
* The number of samples for the DAC waveform:
* numSamples = endAddr - startAddr + 1;
* see \ref cy_stc_autanalog_dac_ch_t.
*
* \param waveform
* The pointer to the location of the DAC waveform data.
*
* \return
* Status of execution, \ref cy_en_autanalog_status_t.
*
*******************************************************************************/
cy_en_autanalog_status_t Cy_AutAnalog_DAC_Data_ReadWaveform(uint8_t dacIdx, uint16_t dataIdx, uint16_t numSamples, int32_t * waveform);


