PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog_dac.h
/*******************************************************************************
* Function Name: Cy_AutAnalog_DAC_Data_GetDriveModeArray
****************************************************************************//**
*
* Reads the block of Drive mode configurations for the DAC output from the look-up table.
* \note The DAC should not output a waveform while this API is being called.
* \note The function does not apply if the channel operMode is set to
* CY_AUTANALOG_DAC_WAVEFORM_MODE_DATA, see \ref cy_stc_autanalog_dac_ch_t::operMode.
*
* \param dacIdx
* The index of the DAC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::dac
*
* \param dataIdx
* Start index of the waveform in the DAC look-up table.
* See \ref cy_stc_autanalog_dac_ch_t::startAddr
*
* \param numSamples
* The number of samples for the DAC waveform:
* numSamples = endAddr - startAddr + 1;
* see \ref cy_stc_autanalog_dac_ch_t.
*
* \param driveModeArray
* The pointer to the location of the DAC output drive mode configurations,
* see \ref cy_en_autanalog_dac_out_drive_mode_t.
*
* \return
* Status of execution, \ref cy_en_autanalog_status_t.
*
*******************************************************************************/
cy_en_autanalog_status_t Cy_AutAnalog_DAC_Data_GetDriveModeArray(uint8_t dacIdx, uint16_t dataIdx, uint16_t numSamples, cy_en_autanalog_dac_out_drive_mode_t * driveModeArray);


/*******************************************************************************
* Function Name: Cy_AutAnalog_DAC_Data_WriteWaveform
****************************************************************************//**
*
* Writes a block of samples for the entire waveform into the DAC look-up table,
* starting from a defined index.
* \note The DAC should not output a waveform while this API is being called.
* \note The function does not apply if the channel operMode is set to
* CY_AUTANALOG_DAC_WAVEFORM_MODE_DATA, see \ref cy_stc_autanalog_dac_ch_t::operMode.
*
* \param dacIdx
* The index of the DAC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::dac
*
* \param dataIdx
* Start index of the waveform in the DAC look-up table.
* See \ref cy_stc_autanalog_dac_ch_t::startAddr
*
* \param numSamples
* The number of samples for the DAC waveform:
* numSamples = endAddr - startAddr + 1;
* see \ref cy_stc_autanalog_dac_ch_t.
*
* \param waveform
* The pointer to the location of the DAC waveform data.
*
* \return
* Status of execution, \ref cy_en_autanalog_status_t.
*
*******************************************************************************/
cy_en_autanalog_status_t Cy_AutAnalog_DAC_Data_WriteWaveform(uint8_t dacIdx, uint16_t dataIdx, uint16_t numSamples, const int32_t * waveform);


/*******************************************************************************
* Function Name: Cy_AutAnalog_DAC_Data_SetDriveModeArray
****************************************************************************//**
*
* Writes a block of Drive mode configurations for the DAC output to the look-up table.
* \note The DAC should not output a waveform while this API is being called.
* \note The function does not apply if the channel operMode is set to
* CY_AUTANALOG_DAC_WAVEFORM_MODE_DATA, see \ref cy_stc_autanalog_dac_ch_t::operMode.
*
* \param dacIdx
* The index of the DAC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::dac
*
* \param dataIdx
* Start index of the waveform in the DAC look-up table.
* See \ref cy_stc_autanalog_dac_ch_t::startAddr
*
* \param numSamples
* The number of samples for the waveform:
* numSamples = endAddr - startAddr + 1;
* see \ref cy_stc_autanalog_dac_ch_t.
*
* \param driveModeArray
* The pointer to the location of the DAC output drive mode configurations,
* see \ref cy_en_autanalog_dac_out_drive_mode_t.
*
* \return
* Status of execution, \ref cy_en_autanalog_status_t.
*
*******************************************************************************/
cy_en_autanalog_status_t Cy_AutAnalog_DAC_Data_SetDriveModeArray(uint8_t dacIdx, uint16_t dataIdx, uint16_t numSamples, const cy_en_autanalog_dac_out_drive_mode_t * driveModeArray);


/*******************************************************************************
* Function Name: Cy_AutAnalog_DAC_Data_SetDriveModeAll
****************************************************************************//**
*
* Modifies the DAC output Drive mode for the entire look-up table
* according to the supplied configuration.
* \note The DAC should not output a waveform while this API is being called.
* \note The function does not apply if the channel operMode is set to
* CY_AUTANALOG_DAC_WAVEFORM_MODE_DATA, see \ref cy_stc_autanalog_dac_ch_t::operMode.
*
* \param dacIdx
* The index of the DAC subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::dac
* \note Under invalid DAC index, the function has no effect.
*
* \param driveModeAll
* The DAC output drive mode configuration,
* see \ref cy_en_autanalog_dac_out_drive_mode_t.
*
*******************************************************************************/
void Cy_AutAnalog_DAC_Data_SetDriveModeAll(uint8_t dacIdx, const cy_en_autanalog_dac_out_drive_mode_t driveModeAll);

/** \} group_autanalog_dac_functions_lut */

/** \} group_autanalog_dac_functions */

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXS22LPPASS_DAC */

#endif /** !defined(CY_AUTANALOG_DAC_H) */

/** \} group_autanalog_dac */

/* [] END OF FILE */
